CREATE DATABASE Фонотека
ON 
(
    NAME = 'fonoteka_batyr_data',
    FILENAME = 'C:\Games\data_baza\fonoteka_batyr.mdf',
    SIZE = 8MB,
    MAXSIZE = 50MB,
    FILEGROWTH = 5MB
)
LOG ON
(
    NAME = 'fonoteka_batyr_log',
    FILENAME = 'C:\Games\data_baza\fonoteka_batyr.ldf',
    SIZE = 5MB,
    MAXSIZE = 25MB,
    FILEGROWTH = 5MB
);
GO

USE Фонотека;


CREATE TABLE КатегорииДисков (
    КодКатегорииДиска INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);

CREATE TABLE Страны (
    КодСтраны INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);

CREATE TABLE Исполнители (
    КодИсполнителя INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE АвторыМузыки (
    КодАвтораМузыки INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE АвторыТекста (
    КодАвтораТекста INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE КатегорииПроизведений (
    КодКатегории INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);


CREATE TABLE МузыкальныеПроизведения (
    КодПроизведения INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL,
    КодКатегории INT NULL,
    Текст TEXT NULL,
    КодАвтораТекста INT NULL,
    КодАвтораМузыки INT NULL,
    КодИсполнителя INT NULL,
    CHECK (LEN(Наименование) > 0),
    FOREIGN KEY (КодКатегории) REFERENCES КатегорииПроизведений(КодКатегории),
    FOREIGN KEY (КодАвтораТекста) REFERENCES АвторыТекста(КодАвтораТекста),
    FOREIGN KEY (КодАвтораМузыки) REFERENCES АвторыМузыки(КодАвтораМузыки),
    FOREIGN KEY (КодИсполнителя) REFERENCES Исполнители(КодИсполнителя)

);


CREATE TABLE Диск (
    КодДиска INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL,
    ДатаВыпуска DATE,
    КодКатегорииДиска INT NULL,
    КодТипаИсполнителя INT NULL,
    КодСтраны INT NULL,
    ПродолжительностьЗвучания TIME NULL,
    ЦенаЗалоговая DECIMAL(10,2) CHECK (ЦенаЗалоговая > 0),
    СтоимостьАрендыЗаДень DECIMAL(10,2) CHECK (СтоимостьАрендыЗаДень >= 0),
    ОбщееКоличествоЭкземпляров INT CHECK (ОбщееКоличествоЭкземпляров >= 0),
    НаличиеЭкземпляров INT CHECK (НаличиеЭкземпляров >= 0),
    FOREIGN KEY (КодКатегорииДиска) REFERENCES КатегорииДисков(КодКатегорииДиска),
    FOREIGN KEY (КодТипаИсполнителя) REFERENCES Исполнители(КодИсполнителя),
    FOREIGN KEY (КодСтраны) REFERENCES Страны(КодСтраны)
);


CREATE TABLE СодержимоеДисков (
    КодДиска INT,
    КодМузыкальногоПроизведения INT,
    PRIMARY KEY (КодДиска, КодМузыкальногоПроизведения),
    FOREIGN KEY (КодДиска) REFERENCES Диск(КодДиска),  
    FOREIGN KEY (КодМузыкальногоПроизведения) REFERENCES МузыкальныеПроизведения(КодПроизведения)
        
);


CREATE TABLE Клиент (
    КодКлиента INT PRIMARY KEY,
    ФИОКлиента CHAR(70) NOT NULL,
    АдресПроживания CHAR(100),
    Телефон CHAR(15) UNIQUE CHECK (Телефон LIKE '[0-9]%')
);


CREATE TABLE Движение (
    НомерЗаписи INT PRIMARY KEY,
    НомерДиска INT NULL,
    КодКлиента INT NULL,
    ДатаВыдачи DATE NOT NULL,
    СрокВыдачи INT CHECK (СрокВыдачи > 0),
    ДатаВозврата DATE NULL,
    FOREIGN KEY (НомерДиска) REFERENCES Диск(КодДиска),
    FOREIGN KEY (КодКлиента) REFERENCES Клиент(КодКлиента)
);



INSERT INTO КатегорииДисков (КодКатегорииДиска, Наименование) VALUES
(1, 'Инди'),
(2, 'Поп-рок'),
(3, 'Симфоническая музыка'),
(4, 'Блюз'),
(5, 'Техно'),
(6, 'Этно'),
(7, 'Латино'),
(8, 'Рэп'),
(9, 'Соул'),
(10, 'Панк');


INSERT INTO Страны (КодСтраны, Наименование) VALUES
(1, 'Казахстан'),
(2, 'Канада'),
(3, 'Швеция'),
(4, 'Нидерланды'),
(5, 'Бразилия'),
(6, 'Южная Корея'),
(7, 'Индия'),
(8, 'Аргентина'),
(9, 'Новая Зеландия'),
(10, 'Ирландия');


INSERT INTO Исполнители (КодИсполнителя, ФИО_или_Наименование) VALUES
(1, 'Аркадий Солнцев'),
(2, 'Olivia Carter'),
(3, 'The Silver Waves'),
(4, 'Noah Reed'),
(5, 'Luna Vega'),
(6, 'Drake Miles'),
(7, 'Harper Lee'),
(8, 'Crystal Dream'),
(9, 'Marcus Grey'),
(10, 'Eliot Shore');



INSERT INTO АвторыМузыки (КодАвтораМузыки, ФИО_или_Наименование) VALUES
(1, 'Андрей Ким'),
(2, 'Samuel Owens'),
(3, 'Luna Vega'),
(4, 'Аркадий Солнцев'),
(5, 'Olivia Carter'),
(6, 'Marcus Grey'),
(7, 'Kwon Jae-Hoon'),
(8, 'Drake Miles'),
(9, 'Harper Lee'),
(10, 'Eliot Shore');



INSERT INTO АвторыТекста (КодАвтораТекста, ФИО_или_Наименование) VALUES
(1, 'Olivia Carter'),
(2, 'Noah Reed'),
(3, 'Harper Lee'),
(4, 'Luna Vega'),
(5, 'Marcus Grey'),
(6, 'Drake Miles'),
(7, 'Аркадий Солнцев'),
(8, 'Eliot Shore'),
(9, 'Crystal Dream'),
(10, 'Samuel Owens');



INSERT INTO КатегорииПроизведений (КодКатегории, Наименование) VALUES
(1, 'Этюд'),
(2, 'Баллада'),
(3, 'Соната'),
(4, 'Гимн'),
(5, 'Электронная композиция'),
(6, 'Песня'),
(7, 'Латино-композиция'),
(8, 'Рэп-композиция'),
(9, 'Инструментал'),
(10, 'Симфония');



INSERT INTO МузыкальныеПроизведения (КодПроизведения, Наименование, КодКатегории, Текст, КодАвтораТекста, КодАвтораМузыки, КодИсполнителя) VALUES
(1, 'Silent River', 1, 'Flowing quietly through the night...', 1, 3, 3),
(2, 'Morning Flame', 2, 'Rise and shine, the day is calling...', 2, 4, 4),
(3, 'Neon Heart', 5, 'My love is glowing through the city lights...', 6, 8, 6),
(4, 'Dance of Time', 1, 'Every second feels like forever...', 4, 7, 7),
(5, 'Lost Horizon', 6, 'Beyond the edge of what we know...', 10, 7, 9),
(6, 'Broken Skyline', 9, 'The lights are fading out tonight...', 6, 8, 6),
(7, 'Midnight Bloom', 3, 'Under the moon, the flowers breathe...', 8, 7, 8),
(8, 'Shadows Fall', 1, 'Don’t let the darkness take your soul...', 4, 7, 7),
(9, 'Faithless Dream', 2, 'I saw you walking in my sleep...', 3, 9, 9),
(10, 'Stay With Me', 7, 'When the music fades, stay close to me...', 2, 5, 4),
(11, 'Echoes', 2, 'Can you hear me in the distance...', 8, 9, 8),
(12, 'Falling Leaves', 3, 'Colors fade, but I remain...', 1, 3, 1),
(13, 'Waves of Light', 6, 'The ocean sings our melody...', 5, 5, 4),
(14, 'Into the Sky', 2, 'We could fly, if we just believe...', 2, 4, 5),
(15, 'Silver Moon', 1, 'The night remembers your name...', 4, 5, 10),
(16, 'Chasing Stars', 3, 'I keep reaching for what’s gone...', 2, 5, 4),
(17, 'Burning Sun', 9, 'Do you ever feel the fire rise...', 2, 8, 6),
(18, 'One More Breath', 6, 'Hold on, I’m not letting go...', 7, 9, 10),
(19, 'Golden Path', 1, 'Follow the road to where dreams begin...', 9, 7, 6),
(20, 'Last Goodbye', 5, 'Whisper my name in the rain...', 1, 3, 1);



INSERT INTO Диск (КодДиска, Наименование, ДатаВыпуска, КодКатегорииДиска, КодТипаИсполнителя, КодСтраны, ПродолжительностьЗвучания, ЦенаЗалоговая, СтоимостьАрендыЗаДень, ОбщееКоличествоЭкземпляров, НаличиеЭкземпляров) VALUES
(1, 'Silent River', '2015-06-12', 3, 1, 1, '00:48:00', 320.00, 25.00, 45, 45),
(2, 'Morning Flame', '2018-04-10', 2, 7, 2, '00:42:00', 520.00, 36.00, 100, 100),
(3, 'Neon Heart', '2020-09-01', 1, 9, 3, '00:44:00', 370.00, 30.00, 70, 70),
(4, 'Dance of Time', '2013-11-22', 1, 1, 4, '00:47:00', 410.00, 29.00, 60, 60),
(5, 'Lost Horizon', '2019-05-05', 4, 5, 5, '00:39:00', 260.00, 21.00, 30, 30),
(6, 'Broken Skyline', '2017-08-18', 5, 6, 6, '00:44:00', 460.00, 33.00, 80, 80),
(7, 'Midnight Bloom', '2021-02-14', 1, 8, 7, '01:02:00', 610.00, 41.00, 120, 120),
(8, 'Faithless Dream', '2016-04-19', 2, 9, 8, '00:42:00', 510.00, 39.00, 110, 110),
(9, 'Echoes', '2014-10-25', 1, 10, 9, '00:41:00', 460.00, 37.00, 90, 90),
(10, 'Falling Leaves', '2013-09-18', 1, 1, 10, '00:35:00', 360.00, 28.00, 50, 50),
(11, 'Chasing Stars', '2022-03-03', 2, 6, 6, '00:45:00', 410.00, 31.00, 80, 80),
(12, 'One More Breath', '2021-09-11', 2, 6, 8, '00:38:00', 360.00, 29.00, 75, 75),
(13, 'Waves of Light', '2019-08-23', 5, 4, 5, '00:45:00', 380.00, 30.00, 65, 65),
(14, 'Golden Path', '2023-10-22', 7, 8, 7, '00:51:00', 430.00, 33.00, 90, 90),
(15, 'Silver Moon', '2020-07-19', 3, 9, 9, '00:43:00', 490.00, 35.00, 100, 100),
(16, 'Burning Sun', '2018-12-12', 8, 8, 2, '00:57:00', 460.00, 33.00, 60, 60),
(17, 'Neon Skies', '2020-09-27', 9, 7, 5, '00:51:00', 510.00, 36.00, 120, 120),
(18, 'Into the Sky', '2023-02-27', 1, 10, 6, '00:40:00', 360.00, 30.00, 85, 85),
(19, 'Stay With Me', '2022-04-29', 1, 4, 6, '00:48:00', 480.00, 34.00, 95, 95),
(20, 'Last Goodbye', '2021-11-15', 9, 8, 5, '00:52:00', 430.00, 32.00, 110, 110);



INSERT INTO СодержимоеДисков (КодДиска, КодМузыкальногоПроизведения) VALUES
(1, 1), (1, 2), (1, 3), (1, 4),
(2, 5), (2, 6), (2, 7), (2, 8),
(3, 9), (3, 10), (3, 11), (3, 12),
(4, 13), (4, 14), (4, 15), (4, 16),
(5, 17), (5, 18), (5, 19), (5, 20),
(6, 1), (6, 2), (6, 3), (6, 4),
(7, 5), (7, 6), (7, 7), (7, 8),
(8, 9), (8, 10), (8, 11), (8, 12),
(9, 13), (9, 14), (9, 15), (9, 16),
(10, 17), (10, 18), (10, 19), (10, 20),
(11, 1), (11, 2), (11, 3), (11, 4),
(12, 5), (12, 6), (12, 7), (12, 8),
(13, 9), (13, 10), (13, 11), (13, 12),
(14, 13), (14, 14), (14, 15), (14, 16),
(15, 17), (15, 18), (15, 19), (15, 20),
(16, 1), (16, 2), (16, 3), (16, 4);



INSERT INTO Клиент (КодКлиента, ФИОКлиента, АдресПроживания, Телефон) VALUES
(1, 'Айдан Садыков', 'Астана, пр. Туран, 25', '87001112201'),
(2, 'Диана Ахметова', 'Алматы, ул. Абая, 40', '87001112202'),
(3, 'Марат Жумабаев', 'Караганда, ул. Бухар Жырау, 18', '87001112203'),
(4, 'Сабина Ермекова', 'Шымкент, ул. Тауке хана, 12', '87001112204'),
(5, 'Ержан Беков', 'Актобе, ул. 8 Марта, 7', '87001112205'),
(6, 'Аружан Калдыбаева', 'Павлодар, ул. Ломоносова, 9', '87001112206'),
(7, 'Арман Сейтов', 'Костанай, ул. Абая, 15', '87001112207'),
(8, 'Айгуль Тлеулина', 'Тараз, ул. Байзак батыра, 5', '87001112208'),
(9, 'Руслан Рахимов', 'Кокшетау, ул. Мира, 11', '87001112209'),
(10, 'Алиса Ким', 'Уральск, ул. Гагарина, 4', '87001112210'),
(11, 'Алексей Иванов', 'Петропавловск, ул. Назарбаева, 10', '87001112211'),
(12, 'Жанар Аманова', 'Семей, ул. Сейфуллина, 8', '87001112212'),
(13, 'Ерасыл Даулетов', 'Кызылорда, ул. Толе би, 16', '87001112213'),
(14, 'Владислав Коншин', 'Талдыкорган, ул. Абылай хана, 6', '87001112214'),
(15, 'Дария Ахметова', 'Атырау, ул. Азаттык, 3', '87001112215'),
(16, 'Бекзат Искаков', 'Темиртау, ул. Комсомольская, 5', '87001112216'),
(17, 'Айгерим Нуртас', 'Экибастуз, ул. Победы, 9', '87001112217'),
(18, 'Руслан Мусаев', 'Риддер, ул. Ленина, 14', '87001112218'),
(19, 'Гульмира Рахметова', 'Жезказган, ул. Кунаева, 7', '87001112219'),
(20, 'Екатерина Токарева', 'Актау, ул. 17 мкр, д.5', '87001112220');



INSERT INTO Движение (НомерЗаписи, НомерДиска, КодКлиента, ДатаВыдачи, СрокВыдачи, ДатаВозврата) VALUES
(1, 1, 1, '2024-09-01', 7, '2024-09-08'),
(2, 2, 2, '2024-09-02', 5, '2024-09-07'),
(3, 3, 3, '2024-09-03', 10, '2024-09-13'),
(4, 4, 4, '2024-09-04', 3, '2024-09-07'),
(5, 5, 5, '2024-09-05', 14, '2024-09-19'),
(6, 6, 6, '2024-09-06', 7, '2024-09-13'),
(7, 7, 7, '2024-09-07', 21, '2024-09-28'),
(8, 8, 8, '2024-09-08', 4, '2024-09-12'),
(9, 9, 9, '2024-09-09', 8, '2024-09-17'),
(10, 10, 10, '2024-09-10', 5, '2024-09-15'),
(11, 11, 11, '2024-09-11', 12, '2024-09-23'),
(12, 12, 12, '2024-09-12', 3, '2024-09-15'),
(13, 13, 13, '2024-09-13', 6, '2024-09-19'),
(14, 14, 14, '2024-09-14', 7, '2024-09-21'),
(15, 15, 15, '2024-09-15', 10, '2024-09-25'),
(16, 16, 16, '2024-09-16', 5, '2024-09-21'),
(17, 17, 17, '2024-09-17', 6, '2024-09-23'),
(18, 18, 18, '2024-09-18', 8, '2024-09-26'),
(19, 19, 19, '2024-09-19', 4, '2024-09-23'),
(20, 20, 20, '2024-09-20', 9, '2024-09-29');

